modules/simpeg/models/EpsMastfip.php

SELECT * FROM "eps_tablokb" WHERE "KOLOK"='60000316'
SELECT * FROM "eps_tablokb" WHERE "KOLOK"='60000000'
---
    public function getUnorDetail()
    {
        $kolok = $this->A_01.$this->A_02.$this->A_03.$this->A_04;
        if(EpsTablokb::findOne($kolok) === null) $nama = $kolok;
        else{
            $ind = EpsTablokb::findOne($kolok)['INDUK'];
            $bid = EpsTablokb::findOne($kolok)['BIDANG'];
            $unt = EpsTablokb::findOne($kolok)['UNIT'];
            if($ind === null) $ind = '-';
            if($bid === null) $bid = '-';
            if($unt === null) $unt = '-';

            $nama = EpsTablokb::findOne($unt)['NALOK'];

            if($unt != $bid) $nama = $nama." - ".EpsTablokb::findOne($bid)['NALOK'];

SELECT * FROM "eps_tablokb" WHERE "KOLOK"='60000316'
---
    public function getUnorUnit()
    {
        $kolok = $this->A_01.$this->A_02.$this->A_03.$this->A_04;

        if(EpsTablokb::findOne($kolok) === null) $unit = $kolok;
        else{
            $unit = EpsTablokb::findOne($kolok)['UNIT'];