modules/sitampan/controllers/FpTbDaftarfingerController.php

    public function actionIndex()
    {
        $searchModel = new FpTbDaftarfingerSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->query->orderBy(['kodealamat' => SORT_ASC]);

        $lokasi = FpTbAlamat2::find()->orderBy(['kodealamat' => SORT_ASC])->all();
---
SELECT * FROM "tb_alamat2" ORDER BY "kodealamat"

    public function actionDevice($id)
    {
        $model = $this->findModel($id);
        $model['device'] = '';
        $model->save(false);

        $log = new FpLogAktivitas();
        $log['kode'] = $model['nip'].'-'.time();
        $log['nip'] = $model['nip'];
        $log['tgl'] = date('Y-m-d H:i:s');
        $log['aktivitas'] = 3;
        $log->save(false);
---
INSERT INTO "log_aktivitas" ("kode", "nip", "tgl", "aktivitas") VALUES ('198209252024212010-1732509662', '198209252024212010', '2024-11-25 11:41:02', 3) RETURNING "kode"

    public function actionLokasi($id)
    {
        $model = $this->findModel($id);

        $lok = FpTbAlamat2::find()->orderBy(['alamat' => SORT_ASC])->all();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            $log = new FpLogAktivitas();
            $log['kode'] = $model['nip'].'-'.time();
            $log['nip'] = $model['nip'];
            $log['tgl'] = date('Y-m-d H:i:s');
            $log['aktivitas'] = 2;
            $log->save(false);
---
SELECT * FROM "tb_alamat2" ORDER BY "alamat"
INSERT INTO "log_aktivitas" ("kode", "nip", "tgl", "aktivitas") VALUES ('198209252024212010-1732509458', '198209252024212010', '2024-11-25 11:37:38', 2) RETURNING "kode"