modules/sitampan/controllers/KesraController.php

    public function actionReset()
    {
        $searchModel = new FpTbDaftarfingerSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->query->orderBy(['kodealamat' => SORT_ASC]);

        $lokasi = FpTbAlamat2::find()->orderBy(['kodealamat' => SORT_ASC])->all();
---
SELECT * FROM "tb_alamat2" ORDER BY "kodealamat"

    public function actionPassword($id)
    {
        $model = $this->findModelPres($id);
        $model['password'] = md5(substr($model['nip'],0,8));
        if($model->save(false)){

            $log = new FpLogAktivitas();
            $log['kode'] = $model['nip'].'-'.time();
            $log['nip'] = $model['nip'];
            $log['tgl'] = date('Y-m-d H:i:s');
            $log['aktivitas'] = 4;
            $log->save(false);
---
INSERT INTO "log_aktivitas" ("kode", "nip", "tgl", "aktivitas") VALUES ('199403142023212023-1732518105', '199403142023212023', '2024-11-25 14:01:45', 4) RETURNING "kode"

    public function actionDevice($id)
    {
        $model = $this->findModelPres($id);
        $model['device'] = '';
        if($model->save(false)){
            $log = new FpLogAktivitas();
            $log['kode'] = $model['nip'].'-'.time();
            $log['nip'] = $model['nip'];
            $log['tgl'] = date('Y-m-d H:i:s');
            $log['aktivitas'] = 3;
            $log->save(false);
---
INSERT INTO "log_aktivitas" ("kode", "nip", "tgl", "aktivitas") VALUES ('196801222021212003-1732515623', '196801222021212003', '2024-11-25 13:20:23', 3) RETURNING "kode"